# -*- coding: utf-8 -*-
"""
Задание 4 (урок 14. Исключения).
Возьмем код из урока про файлы. Мы запрашиваем у пользователя имя файла, который нужно открыть для чтения.
Но пользователь может неверно ввести имя файла и, соответственно, он не откроется.
Необходимо дополнить код обработкой такого исключения.
"""


def my_f(nam, mod):  # определяем функцию
    try:
        with open(nam, mod, encoding='utf-8') as fl:  # открываем файл
            txt = fl.read()  # считываем все из файла и помещаем в переменную
            txt = txt.replace('\n', ' ')  # меняем все переходы на новую строку на простой пробел
            txt = txt.replace('  ', ' ')  # меняем двойные пробелы если такие есть на одиночный
            sp = []  # создаем пустой список
            sp = txt.split()  # создаем список из текста
            for i in range(len(sp) - 1, -1, -1):  # перебираем список
                if len(sp[i]) == 1:  # проверяем элементы длиной в 1 символ
                    if not sp[i].isalpha():  # проверяем если это не символ, то удаляем его
                        del sp[i]
    except FileNotFoundError:  # если файла с таким именем нет, open выкинет FileNotFoundError
        print('Нет такого файла')
    else:
        return print(f'Количество слов в файле: {len(sp)}')  # выводим длину списка


my_f(input('Введите имя файла: '), 'r')  # вызов функции
